app/controllers/manager/transaction_histories_controller.rb

SELECT "transaction_histories".* FROM "transaction_histories" WHERE ("transaction_histories"."created_at" BETWEEN $1 AND $2)  [["created_at", "01/03/2018"], ["created_at", "02/08/2018"]]
SELECT  "transaction_histories".* FROM "transaction_histories" WHERE ("transaction_histories"."created_at" BETWEEN $1 AND $2) LIMIT $3 OFFSET $4  [["created_at", "2018-03-01 00:00:00"], ["created_at", "2018-08-02 00:00:00"], ["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @transaction_histories = TransactionHistory.all
    if !params[:type].nil? && params[:type] != ""
      @transaction_histories = @transaction_histories.where(trans_type: params[:type].to_i)
    end
    if !params[:user].nil? && params[:user] != ""
      user_ids = User.where("lower(concat(fname,' ',lname)) like (?)","%#{params[:user].downcase}%").map(&:id)
      @transaction_histories = @transaction_histories.where(user_id: user_ids)
    end
    if !params[:date_range].nil? && params[:date_range] != ""
      date = params[:date_range].split(' - ')
      sdate = date[0].to_datetime
      edate = date[1].to_datetime
      @transaction_histories = @transaction_histories.where(created_at: sdate.beginning_of_day..edate.beginning_of_day)
    end
    respond_to do |format|
      format.html{@transaction_histories = @transaction_histories.paginate(:page => params[:page], :per_page =>25)}