app/controllers/transaction_histories_controller.rb

  def index
    @transaction_histories = current_user.transaction_histories.paginate(:page => params[:page], :per_page =>25)
---
SELECT  "transaction_histories".* FROM "transaction_histories" WHERE "transaction_histories"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

  def create
    # @transaction_history = TransactionHistory.new(transaction_history_params)
    @transaction_history = current_user.transaction_histories.build(transaction_history_params)

    respond_to do |format|
      if @transaction_history.save
---
INSERT INTO "transaction_histories" ("user_id", "desc", "amount", "trans_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["desc", "q34eq3434"], ["amount", 12.0], ["trans_type", 2], ["created_at", "2018-01-24 13:02:07.493998"], ["updated_at", "2018-01-24 13:02:07.493998"]]